
# 2 - Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов исходной последовательности. 
# Не использовать множества.
# Постарайтесь решить за одно условие
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]
#-------------------------------------------------------------

import os
os.system('cls')
#----------------------

def uniqList(list):
    uniqElemList = [i for i in list if list.count(i) == 1]
    return uniqElemList

print("-"*90)
list = [1, 1, 2, 3, 4, 4, 5, 6, 6, 6, 7, 8, 9, 9, 10, 11, 11, 12, 12]
result = uniqList(list)

print(f'Дана последовательность: {list}')
print(f'в результате получаем {result}')
print("-"*90)